Revit 2026 API

# BuiltInFailuresExternalResourceReferenceFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresExternalResourceReferenceFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternalResourceReferenceFailures
```
```vb
Public NotInheritable Class ExternalResourceReferenceFailures
```
```cpp
public ref class ExternalResourceReferenceFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceReferenceFailures = class end
```

The BuiltInFailuresExternalResourceReferenceFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReferenceToLocalFile | The External Resource refers to a local file that may not be available to workshared users. |

#### Reference

Autodesk.Revit.DB Namespace